*** load library
perchance to dream
https://common-lisp.net/project/iterate/doc/index.html#Top

http://www.gigamonkeys.com/book/programming-in-the-large-packages-and-symbols.html
In the REPL buffer in SLIME you can also change packages with a REPL shortcut. Type a comma, and then enter change-package at the Command: prompt.
#+BEGIN_SRC lisp
(ql:quickload "iterate")
(in-package #:iterate)

;; (mapcar #'package-name (package-use-list :cl-user))
#+END_SRC

#+RESULTS:
: #<Package "ITERATE">
*** basic collect
#+BEGIN_SRC lisp
(iterate 
  (for n from 1 to 10)
  (collect (* n n)))
#+END_SRC

#+RESULTS:
| 1 | 4 | 9 | 16 | 25 | 36 | 49 | 64 | 81 | 100 |
*** iterate in parallel
#+BEGIN_SRC lisp
(iterate 
  (for n from 2 to 3)
  (for k in '(10 100))
  (collect (* k n)))
#+END_SRC

#+RESULTS:
| 20 | 300 |
*** nested iterate loop
#+BEGIN_SRC lisp
(iterate 
  (for n from 1 to 10)
  (collect
      (iterate 
	(for k in '(10 100 1000))
	(collect (* k n)))))
#+END_SRC

#+RESULTS:
|  10 |  100 |  1000 |
|  20 |  200 |  2000 |
|  30 |  300 |  3000 |
|  40 |  400 |  4000 |
|  50 |  500 |  5000 |
|  60 |  600 |  6000 |
|  70 |  700 |  7000 |
|  80 |  800 |  8000 |
|  90 |  900 |  9000 |
| 100 | 1000 | 10000 |

#+BEGIN_SRC lisp
(iter (for x from 1 to 24)  
 (collect x into xs)
 (collect (random2 0 10) into ys)
 (finally (return (mk-bpf xs ys))))
#+END_SRC
** dotimes
#+BEGIN_SRC lisp :results output
(dotimes (x 10) (print (random 10)))
#+END_SRC

#+RESULTS:
#+begin_example

7 
2 
7 
6 
5 
2 
0 
6 
0 
9 
#+end_example

#+BEGIN_SRC lisp

#+END_SRC
** iterating with nested mapcar
#+BEGIN_SRC lisp
(iter
  (for x from 0 to 2)
  (collect
      (mapcar #'(lambda (deep-lst)
	    (mapcar #'(lambda (lst) (nth x lst)) deep-lst))
	      '(((0 1 2) (a b c) (7 8 9) (x y z)))
	      )))
#+END_SRC

#+BEGIN_SRC lisp
(let ((pc-list '((60 64 67) (61 65 68) (62 68 69))))
  (iter
    (for x from 0 to 2)
    (collect 
	(mapcar #'(lambda (lst) (nth x lst)) '((0 1 2) (60 61 62) (61 65 68))))))
#+END_SRC

#+RESULTS:
| 0 | 60 | 61 |
| 1 | 61 | 65 |
| 2 | 62 | 68 |

* a reduce I was looking for without reduce
#+BEGIN_SRC lisp
(apply #'mapcar #'list '((1 2 3) (a b c)))
#+END_SRC

#+RESULTS:
| 1 | A |
| 2 | B |
| 3 | C |
** printing out
#+BEGIN_SRC lisp
(defun dot->png (fname thunk)
  (with-open-file 
      (*standard-output* fname :direction :output :if-exists :supersede) 
    (funcall thunk))
  (ext:shell (concatenate 'string "dot -Tpng -O " fname)))
#+END_SRC

#+BEGIN_SRC lisp
(with-open-file (my-stream "testfile.txt" ;;  ~/Github-repos/pwgl-chord-work/testfile.txt
			   :direction :output
			   :if-exists :supersede)
  (princ "Hello File!" my-stream))
#+END_SRC

#+BEGIN_SRC lisp
(("4-1" '4-1) ("4-2A" '4-2A) ("4-2B" '4-2B) ("4-3" '4-3) ("4-4A" '4-4A) ("4-4B" '4-4B) ("4-5A" '4-5A) ("4-5B" '4-5B) ("4-6" '4-6) ("4-7" '4-7) ("4-8" '4-8) ("4-9" '4-9) ("4-10" '4-10) ("4-11A" '4-11A) ("4-11B" '4-11B) ("4-12A" '4-12A) ("4-12B" '4-12B) ("4-13A" '4-13A) ("4-13B" '4-13B) ("4-14A" '4-14A) ("4-14B" '4-14B) ("4-Z15A" '4-Z15A) ("4-Z15B" '4-Z15B) ("4-16A" '4-16A) ("4-16B" '4-16B) ("4-17" '4-17) ("4-18A" '4-18A) ("4-18B" '4-18B) ("4-19A" '4-19A) ("4-19B" '4-19B) ("4-20" '4-20) ("4-21" '4-21) ("4-22A" '4-22A) ("4-22B" '4-22B) ("4-23" '4-23) ("4-24" '4-24) ("4-25" '4-25) ("4-26" '4-26) ("4-27A" '4-27A) ("4-27B" '4-27B) ("4-28" '4-28) ("4-Z29A" '4-Z29A) ("4-Z29B" '4-Z29B))
#+END_SRC

#+BEGIN_SRC lisp
(list '(3-1 3-2A 3-2B 3-3A 3-3B 3-4A 3-4B 3-5A 3-5B 3-6 3-7A 3-7B 3-8A 3-8B 3-9 3-10 3-11A 3-11B 3-12) '(4-1 4-2A 4-2B 4-3 4-4A 4-4B 4-5A 4-5B 4-6 4-7 4-8 4-9 4-10 4-11A 4-11B 4-12A 4-12B 4-13A 4-13B 4-14A 4-14B 4-Z15A 4-Z15B 4-16A 4-16B 4-17 4-18A 4-18B 4-19A 4-19B 4-20 4-21 4-22A 4-22B 4-23 4-24 4-25 4-26 4-27A 4-27B 4-28 4-Z29A 4-Z29B) '(5-1 5-2A 5-2B 5-3A 5-3B 5-4A 5-4B 5-5A 5-5B 5-6A 5-6B 5-7A 5-7B 5-8 5-9A 5-9B 5-10A 5-10B 5-11A 5-11B 5-Z12 5-13A 5-13B 5-14A 5-14B 5-15 5-16A 5-16B 5-Z17 5-Z18A 5-Z18B 5-19A 5-19B 5-20A 5-20B 5-21A 5-21B 5-22 5-23A 5-23B 5-24A 5-24B 5-25A 5-25B 5-26A 5-26B 5-27A 5-27B 5-28A 5-28B 5-29A 5-29B 5-30A 5-30B 5-31A 5-31B 5-32A 5-32B 5-33 5-34 5-35 5-Z36A 5-Z36B 5-Z37 5-Z38A 5-Z38B) '(6-1 6-2A 6-2B 6-Z3A 6-Z3B 6-Z4 6-5A 6-5B 6-Z6 6-7 6-8 6-9A 6-9B 6-Z10A 6-Z10B 6-Z11A 6-Z11B 6-Z12A 6-Z12B 6-Z13 6-14A 6-14B 6-15A 6-15B 6-16A 6-16B 6-Z17A 6-Z17B 6-18A 6-18B 6-Z19A 6-Z19B 6-20 6-21A 6-21B 6-22A 6-22B 6-Z23 6-Z24A 6-Z24B 6-Z25A 6-Z25B 6-Z26 6-27A 6-27B 6-Z28 6-Z29 6-30A 6-30B 6-31A 6-31B 6-32 6-33A 6-33B 6-34A 6-34B 6-35 6-Z36A 6-Z36B 6-Z37 6-Z38 6-Z39A 6-Z39B 6-Z40A 6-Z40B 6-Z41A 6-Z41B 6-Z42 6-Z43A 6-Z43B 6-Z44A 6-Z44B 6-Z45 6-Z46A 6-Z46B 6-Z47A 6-Z47B 6-Z48 6-Z49 6-Z50) '(7-1 7-2A 7-2B 7-3A 7-3B 7-4A 7-4B 7-5A 7-5B 7-6A 7-6B 7-7A 7-7B 7-8 7-9A 7-9B 7-10A 7-10B 7-11A 7-11B 7-Z12 7-13A 7-13B 7-14A 7-14B 7-15 7-16A 7-16B 7-Z17 7-Z18A 7-Z18B 7-19A 7-19B 7-20A 7-20B 7-21A 7-21B 7-22 7-23A 7-23B 7-24A 7-24B 7-25A 7-25B 7-26A 7-26B 7-27A 7-27B 7-28A 7-28B 7-29A 7-29B 7-30A 7-30B 7-31A 7-31B 7-32A 7-32B 7-33 7-34 7-35 7-Z36A 7-Z36B 7-Z37 7-Z38A 7-Z38B) '(8-1 8-2A 8-2B 8-3 8-4A 8-4B 8-5A 8-5B 8-6 8-7 8-8 8-9 8-10 8-11A 8-11B 8-12A 8-12B 8-13A 8-13B 8-14A 8-14B 8-Z15A 8-Z15B 8-16A 8-16B 8-17 8-18A 8-18B 8-19A 8-19B 8-20 8-21 8-22A 8-22B 8-23 8-24 8-25 8-26 8-27A 8-27B 8-28 8-Z29A 8-Z29B) '(9-1 9-2A 9-2B 9-3A 9-3B 9-4A 9-4B 9-5A 9-5B 9-6 9-7A 9-7B 9-8A 9-8B 9-9 9-10 9-11A 9-11B 9-12) '(10-1 10-2 10-3 10-4 10-5 10-6) '(11-1) )

#+END_SRC

#+RESULTS:
|  3-1 | 3-2A | 3-2B | 3-3A  | 3-3B  | 3-4A | 3-4B | 3-5A | 3-5B |  3-6 | 3-7A | 3-7B | 3-8A | 3-8B   | 3-9    | 3-10   | 3-11A  | 3-11B  | 3-12   |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  4-1 | 4-2A | 4-2B | 4-3   | 4-4A  | 4-4B | 4-5A | 4-5B | 4-6  |  4-7 | 4-8  | 4-9  | 4-10 | 4-11A  | 4-11B  | 4-12A  | 4-12B  | 4-13A  | 4-13B  | 4-14A | 4-14B | 4-Z15A | 4-Z15B | 4-16A | 4-16B |  4-17 | 4-18A  | 4-18B  | 4-19A | 4-19B  | 4-20   | 4-21   | 4-22A | 4-22B | 4-23  | 4-24  | 4-25  |  4-26 | 4-27A  | 4-27B  | 4-28   | 4-Z29A | 4-Z29B |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  5-1 | 5-2A | 5-2B | 5-3A  | 5-3B  | 5-4A | 5-4B | 5-5A | 5-5B | 5-6A | 5-6B | 5-7A | 5-7B | 5-8    | 5-9A   | 5-9B   | 5-10A  | 5-10B  | 5-11A  | 5-11B | 5-Z12 | 5-13A  | 5-13B  | 5-14A | 5-14B |  5-15 | 5-16A  | 5-16B  | 5-Z17 | 5-Z18A | 5-Z18B | 5-19A  | 5-19B | 5-20A | 5-20B | 5-21A | 5-21B |  5-22 | 5-23A  | 5-23B  | 5-24A  | 5-24B  | 5-25A  | 5-25B | 5-26A | 5-26B | 5-27A | 5-27B | 5-28A | 5-28B | 5-29A | 5-29B | 5-30A | 5-30B | 5-31A | 5-31B | 5-32A | 5-32B  |   5-33 |  5-34 |  5-35 | 5-Z36A | 5-Z36B | 5-Z37  | 5-Z38A | 5-Z38B |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  6-1 | 6-2A | 6-2B | 6-Z3A | 6-Z3B | 6-Z4 | 6-5A | 6-5B | 6-Z6 |  6-7 | 6-8  | 6-9A | 6-9B | 6-Z10A | 6-Z10B | 6-Z11A | 6-Z11B | 6-Z12A | 6-Z12B | 6-Z13 | 6-14A | 6-14B  | 6-15A  | 6-15B | 6-16A | 6-16B | 6-Z17A | 6-Z17B | 6-18A | 6-18B  | 6-Z19A | 6-Z19B | 6-20  | 6-21A | 6-21B | 6-22A | 6-22B | 6-Z23 | 6-Z24A | 6-Z24B | 6-Z25A | 6-Z25B | 6-Z26  | 6-27A | 6-27B | 6-Z28 | 6-Z29 | 6-30A | 6-30B | 6-31A | 6-31B | 6-32  | 6-33A | 6-33B | 6-34A | 6-34B | 6-35  | 6-Z36A | 6-Z36B | 6-Z37 | 6-Z38 | 6-Z39A | 6-Z39B | 6-Z40A | 6-Z40B | 6-Z41A | 6-Z41B | 6-Z42 | 6-Z43A | 6-Z43B | 6-Z44A | 6-Z44B | 6-Z45 | 6-Z46A | 6-Z46B | 6-Z47A | 6-Z47B | 6-Z48 | 6-Z49 | 6-Z50 |
|  7-1 | 7-2A | 7-2B | 7-3A  | 7-3B  | 7-4A | 7-4B | 7-5A | 7-5B | 7-6A | 7-6B | 7-7A | 7-7B | 7-8    | 7-9A   | 7-9B   | 7-10A  | 7-10B  | 7-11A  | 7-11B | 7-Z12 | 7-13A  | 7-13B  | 7-14A | 7-14B |  7-15 | 7-16A  | 7-16B  | 7-Z17 | 7-Z18A | 7-Z18B | 7-19A  | 7-19B | 7-20A | 7-20B | 7-21A | 7-21B |  7-22 | 7-23A  | 7-23B  | 7-24A  | 7-24B  | 7-25A  | 7-25B | 7-26A | 7-26B | 7-27A | 7-27B | 7-28A | 7-28B | 7-29A | 7-29B | 7-30A | 7-30B | 7-31A | 7-31B | 7-32A | 7-32B  |   7-33 |  7-34 |  7-35 | 7-Z36A | 7-Z36B | 7-Z37  | 7-Z38A | 7-Z38B |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  8-1 | 8-2A | 8-2B | 8-3   | 8-4A  | 8-4B | 8-5A | 8-5B | 8-6  |  8-7 | 8-8  | 8-9  | 8-10 | 8-11A  | 8-11B  | 8-12A  | 8-12B  | 8-13A  | 8-13B  | 8-14A | 8-14B | 8-Z15A | 8-Z15B | 8-16A | 8-16B |  8-17 | 8-18A  | 8-18B  | 8-19A | 8-19B  | 8-20   | 8-21   | 8-22A | 8-22B | 8-23  | 8-24  | 8-25  |  8-26 | 8-27A  | 8-27B  | 8-28   | 8-Z29A | 8-Z29B |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  9-1 | 9-2A | 9-2B | 9-3A  | 9-3B  | 9-4A | 9-4B | 9-5A | 9-5B |  9-6 | 9-7A | 9-7B | 9-8A | 9-8B   | 9-9    | 9-10   | 9-11A  | 9-11B  | 9-12   |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
| 10-1 | 10-2 | 10-3 | 10-4  | 10-5  | 10-6 |      |      |      |      |      |      |      |        |        |        |        |        |        |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
| 11-1 |      |      |       |       |      |      |      |      |      |      |      |      |        |        |        |        |        |        |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |

#+BEGIN_SRC lisp
(setq all-pcsets (list '(3-1 3-2A 3-2B 3-3A 3-3B 3-4A 3-4B 3-5A 3-5B 3-6 3-7A 3-7B 3-8A 3-8B 3-9 3-10 3-11A 3-11B 3-12) '(4-1 4-2A 4-2B 4-3 4-4A 4-4B 4-5A 4-5B 4-6 4-7 4-8 4-9 4-10 4-11A 4-11B 4-12A 4-12B 4-13A 4-13B 4-14A 4-14B 4-Z15A 4-Z15B 4-16A 4-16B 4-17 4-18A 4-18B 4-19A 4-19B 4-20 4-21 4-22A 4-22B 4-23 4-24 4-25 4-26 4-27A 4-27B 4-28 4-Z29A 4-Z29B) '(5-1 5-2A 5-2B 5-3A 5-3B 5-4A 5-4B 5-5A 5-5B 5-6A 5-6B 5-7A 5-7B 5-8 5-9A 5-9B 5-10A 5-10B 5-11A 5-11B 5-Z12 5-13A 5-13B 5-14A 5-14B 5-15 5-16A 5-16B 5-Z17 5-Z18A 5-Z18B 5-19A 5-19B 5-20A 5-20B 5-21A 5-21B 5-22 5-23A 5-23B 5-24A 5-24B 5-25A 5-25B 5-26A 5-26B 5-27A 5-27B 5-28A 5-28B 5-29A 5-29B 5-30A 5-30B 5-31A 5-31B 5-32A 5-32B 5-33 5-34 5-35 5-Z36A 5-Z36B 5-Z37 5-Z38A 5-Z38B) '(6-1 6-2A 6-2B 6-Z3A 6-Z3B 6-Z4 6-5A 6-5B 6-Z6 6-7 6-8 6-9A 6-9B 6-Z10A 6-Z10B 6-Z11A 6-Z11B 6-Z12A 6-Z12B 6-Z13 6-14A 6-14B 6-15A 6-15B 6-16A 6-16B 6-Z17A 6-Z17B 6-18A 6-18B 6-Z19A 6-Z19B 6-20 6-21A 6-21B 6-22A 6-22B 6-Z23 6-Z24A 6-Z24B 6-Z25A 6-Z25B 6-Z26 6-27A 6-27B 6-Z28 6-Z29 6-30A 6-30B 6-31A 6-31B 6-32 6-33A 6-33B 6-34A 6-34B 6-35 6-Z36A 6-Z36B 6-Z37 6-Z38 6-Z39A 6-Z39B 6-Z40A 6-Z40B 6-Z41A 6-Z41B 6-Z42 6-Z43A 6-Z43B 6-Z44A 6-Z44B 6-Z45 6-Z46A 6-Z46B 6-Z47A 6-Z47B 6-Z48 6-Z49 6-Z50) '(7-1 7-2A 7-2B 7-3A 7-3B 7-4A 7-4B 7-5A 7-5B 7-6A 7-6B 7-7A 7-7B 7-8 7-9A 7-9B 7-10A 7-10B 7-11A 7-11B 7-Z12 7-13A 7-13B 7-14A 7-14B 7-15 7-16A 7-16B 7-Z17 7-Z18A 7-Z18B 7-19A 7-19B 7-20A 7-20B 7-21A 7-21B 7-22 7-23A 7-23B 7-24A 7-24B 7-25A 7-25B 7-26A 7-26B 7-27A 7-27B 7-28A 7-28B 7-29A 7-29B 7-30A 7-30B 7-31A 7-31B 7-32A 7-32B 7-33 7-34 7-35 7-Z36A 7-Z36B 7-Z37 7-Z38A 7-Z38B) '(8-1 8-2A 8-2B 8-3 8-4A 8-4B 8-5A 8-5B 8-6 8-7 8-8 8-9 8-10 8-11A 8-11B 8-12A 8-12B 8-13A 8-13B 8-14A 8-14B 8-Z15A 8-Z15B 8-16A 8-16B 8-17 8-18A 8-18B 8-19A 8-19B 8-20 8-21 8-22A 8-22B 8-23 8-24 8-25 8-26 8-27A 8-27B 8-28 8-Z29A 8-Z29B) '(9-1 9-2A 9-2B 9-3A 9-3B 9-4A 9-4B 9-5A 9-5B 9-6 9-7A 9-7B 9-8A 9-8B 9-9 9-10 9-11A 9-11B 9-12) '(10-1 10-2 10-3 10-4 10-5 10-6) '(11-1) ))

#+END_SRC

#+RESULTS:
|  3-1 | 3-2A | 3-2B | 3-3A  | 3-3B  | 3-4A | 3-4B | 3-5A | 3-5B |  3-6 | 3-7A | 3-7B | 3-8A | 3-8B   | 3-9    | 3-10   | 3-11A  | 3-11B  | 3-12   |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  4-1 | 4-2A | 4-2B | 4-3   | 4-4A  | 4-4B | 4-5A | 4-5B | 4-6  |  4-7 | 4-8  | 4-9  | 4-10 | 4-11A  | 4-11B  | 4-12A  | 4-12B  | 4-13A  | 4-13B  | 4-14A | 4-14B | 4-Z15A | 4-Z15B | 4-16A | 4-16B |  4-17 | 4-18A  | 4-18B  | 4-19A | 4-19B  | 4-20   | 4-21   | 4-22A | 4-22B | 4-23  | 4-24  | 4-25  |  4-26 | 4-27A  | 4-27B  | 4-28   | 4-Z29A | 4-Z29B |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  5-1 | 5-2A | 5-2B | 5-3A  | 5-3B  | 5-4A | 5-4B | 5-5A | 5-5B | 5-6A | 5-6B | 5-7A | 5-7B | 5-8    | 5-9A   | 5-9B   | 5-10A  | 5-10B  | 5-11A  | 5-11B | 5-Z12 | 5-13A  | 5-13B  | 5-14A | 5-14B |  5-15 | 5-16A  | 5-16B  | 5-Z17 | 5-Z18A | 5-Z18B | 5-19A  | 5-19B | 5-20A | 5-20B | 5-21A | 5-21B |  5-22 | 5-23A  | 5-23B  | 5-24A  | 5-24B  | 5-25A  | 5-25B | 5-26A | 5-26B | 5-27A | 5-27B | 5-28A | 5-28B | 5-29A | 5-29B | 5-30A | 5-30B | 5-31A | 5-31B | 5-32A | 5-32B  |   5-33 |  5-34 |  5-35 | 5-Z36A | 5-Z36B | 5-Z37  | 5-Z38A | 5-Z38B |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  6-1 | 6-2A | 6-2B | 6-Z3A | 6-Z3B | 6-Z4 | 6-5A | 6-5B | 6-Z6 |  6-7 | 6-8  | 6-9A | 6-9B | 6-Z10A | 6-Z10B | 6-Z11A | 6-Z11B | 6-Z12A | 6-Z12B | 6-Z13 | 6-14A | 6-14B  | 6-15A  | 6-15B | 6-16A | 6-16B | 6-Z17A | 6-Z17B | 6-18A | 6-18B  | 6-Z19A | 6-Z19B | 6-20  | 6-21A | 6-21B | 6-22A | 6-22B | 6-Z23 | 6-Z24A | 6-Z24B | 6-Z25A | 6-Z25B | 6-Z26  | 6-27A | 6-27B | 6-Z28 | 6-Z29 | 6-30A | 6-30B | 6-31A | 6-31B | 6-32  | 6-33A | 6-33B | 6-34A | 6-34B | 6-35  | 6-Z36A | 6-Z36B | 6-Z37 | 6-Z38 | 6-Z39A | 6-Z39B | 6-Z40A | 6-Z40B | 6-Z41A | 6-Z41B | 6-Z42 | 6-Z43A | 6-Z43B | 6-Z44A | 6-Z44B | 6-Z45 | 6-Z46A | 6-Z46B | 6-Z47A | 6-Z47B | 6-Z48 | 6-Z49 | 6-Z50 |
|  7-1 | 7-2A | 7-2B | 7-3A  | 7-3B  | 7-4A | 7-4B | 7-5A | 7-5B | 7-6A | 7-6B | 7-7A | 7-7B | 7-8    | 7-9A   | 7-9B   | 7-10A  | 7-10B  | 7-11A  | 7-11B | 7-Z12 | 7-13A  | 7-13B  | 7-14A | 7-14B |  7-15 | 7-16A  | 7-16B  | 7-Z17 | 7-Z18A | 7-Z18B | 7-19A  | 7-19B | 7-20A | 7-20B | 7-21A | 7-21B |  7-22 | 7-23A  | 7-23B  | 7-24A  | 7-24B  | 7-25A  | 7-25B | 7-26A | 7-26B | 7-27A | 7-27B | 7-28A | 7-28B | 7-29A | 7-29B | 7-30A | 7-30B | 7-31A | 7-31B | 7-32A | 7-32B  |   7-33 |  7-34 |  7-35 | 7-Z36A | 7-Z36B | 7-Z37  | 7-Z38A | 7-Z38B |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  8-1 | 8-2A | 8-2B | 8-3   | 8-4A  | 8-4B | 8-5A | 8-5B | 8-6  |  8-7 | 8-8  | 8-9  | 8-10 | 8-11A  | 8-11B  | 8-12A  | 8-12B  | 8-13A  | 8-13B  | 8-14A | 8-14B | 8-Z15A | 8-Z15B | 8-16A | 8-16B |  8-17 | 8-18A  | 8-18B  | 8-19A | 8-19B  | 8-20   | 8-21   | 8-22A | 8-22B | 8-23  | 8-24  | 8-25  |  8-26 | 8-27A  | 8-27B  | 8-28   | 8-Z29A | 8-Z29B |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
|  9-1 | 9-2A | 9-2B | 9-3A  | 9-3B  | 9-4A | 9-4B | 9-5A | 9-5B |  9-6 | 9-7A | 9-7B | 9-8A | 9-8B   | 9-9    | 9-10   | 9-11A  | 9-11B  | 9-12   |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
| 10-1 | 10-2 | 10-3 | 10-4  | 10-5  | 10-6 |      |      |      |      |      |      |      |        |        |        |        |        |        |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
| 11-1 |      |      |       |       |      |      |      |      |      |      |      |      |        |        |        |        |        |        |       |       |        |        |       |       |       |        |        |       |        |        |        |       |       |       |       |       |       |        |        |        |        |        |       |       |       |       |       |       |       |       |       |       |       |       |       |       |        |        |       |       |        |        |        |        |        |        |       |        |        |        |        |       |        |        |        |        |       |       |       |
** find . -maxdepth 1 -not -type d
#+BEGIN_SRC bash
find . -maxdepth 1 -not -type d
#+END_SRC

#+RESULTS:
| ./#readme.org#       |
| ./.DS_Store          |
| ./.gitignore         |
| ./problem-code.lisp~ |
| ./problem2.lisp~     |
| ./readme.org         |
| ./readme.org~        |
** find . \( -iname \*\\.pwgl\* \) -ls
#+BEGIN_SRC bash
find . \( -iname \*\\.pwgl\* \) -ls

#+END_SRC

#+RESULTS:
| 17167399 |    96 | -rw-r--r-- | 1 | a | staff |   47779 | Jun | 15 | 10:32 | ./2017-06-13/daily-pc-set-example.pwgl                             |
| 17172865 |    16 | -rw-r--r-- | 1 | a | staff |    8023 | Jun | 23 | 17:39 | ./2017-06-13/trichord-pcset-slider.pwgl                            |
| 17173922 |   360 | -rw-r--r-- | 1 | a | staff |  181554 | Jun | 14 | 05:49 | ./2017-06-13/use-code-boxes-for-pcs.pwgl                           |
| 17174549 |   272 | -rw-r--r-- | 1 | a | staff |  135458 | Jun | 15 | 12:55 | ./2017-06-14/permute-all-tn-octaves-of-cardinality.pwgl            |
| 17184069 |   216 | -rw-r--r-- | 1 | a | staff |  109961 | Jun | 15 | 12:34 | ./2017-06-15/add-velocity-to-score-templates.pwgl                  |
| 17185126 |   176 | -rw-r--r-- | 1 | a | staff |   89432 | Jun | 15 | 16:22 | ./2017-06-15/best-way-to-move-long-non-mensural.pwgl               |
| 17184649 |   184 | -rw-r--r-- | 1 | a | staff |   90589 | Jun | 15 | 21:28 | ./2017-06-15/document-this-ultimate-pcset-listener.pwgl            |
| 17185871 |   280 | -rw-r--r-- | 1 | a | staff |  141787 | Jun | 15 | 16:22 | ./2017-06-15/many-map-enums-with-score-editors.pwgl                |
| 17187929 |    80 | -rw-r--r-- | 1 | a | staff |   37914 | Jun | 15 | 21:28 | ./2017-06-15/map-chords-to-voices.pwgl                             |
| 17184496 |   104 | -rw-r--r-- | 1 | a | staff |   50754 | Jun | 15 | 12:57 | ./2017-06-15/simpler-gentler-random-trichord-template.pwgl         |
| 17188157 |   472 | -rw-r--r-- | 1 | a | staff |  238923 | Jun | 16 | 17:13 | ./2017-06-15/ultimate-three-part-pc-harmonies.pwgl                 |
| 17192091 |    40 | -rw-r--r-- | 1 | a | staff |   18289 | Jun | 16 | 21:14 | ./2017-06-16/choosing-equals-pcset-with-multiscore.pwgl            |
| 17193167 |   120 | -rw-r--r-- | 1 | a | staff |   58394 | Jun | 18 | 21:47 | ./2017-06-16/formatting-set-printouts.pwgl                         |
| 17189228 | 10768 | -rw-r--r-- | 1 | a | staff | 5509698 | Jun | 16 | 17:13 | ./2017-06-16/manipulating-sc4-10-score.pwgl                        |
| 17211098 |    56 | -rw-r--r-- | 1 | a | staff |   28503 | Jun | 18 | 23:20 | ./2017-06-18/collecting-all-multiscore-pmc-rules-in-a-measure.pwgl |
| 17215701 |    96 | -rw-r--r-- | 1 | a | staff |   45611 | Jun | 19 | 18:49 | ./2017-06-19/formatting-and-writing-out-to-file.pwgl               |
| 17217161 |   144 | -rw-r--r-- | 1 | a | staff |   72349 | Jun | 19 | 23:41 | ./2017-06-19/no-adjacent-chord-dups-with-single-pcset.pwgl         |
| 17216643 |    40 | -rw-r--r-- | 1 | a | staff |   18175 | Jun | 19 | 19:05 | ./2017-06-19/openGL-text-macros.pwgl                               |
| 17216925 |    88 | -rw-r--r-- | 1 | a | staff |   40967 | Jun | 19 | 19:18 | ./2017-06-19/simplified-by-set-pmc-searchspace.pwgl                |
| 17217876 |    64 | -rw-r--r-- | 1 | a | staff |   29980 | Jun | 19 | 22:35 | ./2017-06-19/understanding-BPFs-and-interpolation.pwgl             |
| 17220191 |    32 | -rw-r--r-- | 1 | a | staff |   16192 | Jun | 22 | 09:43 | ./2017-06-20/alea-and-breakpoint-functions.pwgl                    |
| 17229060 |     8 | -rw-r--r-- | 1 | a | staff |     275 | Jun | 22 | 10:22 | ./2017-06-22/#empty-pwgl-patch.pwgl#                               |
| 17232063 |     8 | -rw-r--r-- | 1 | a | staff |     635 | Jun | 23 | 06:01 | ./2017-06-22/abstraction-box.pwgl                                  |
| 17229121 |     8 | -rw-r--r-- | 1 | a | staff |    1536 | Jun | 22 | 10:28 | ./2017-06-22/chord-editor.pwgl                                     |
| 17229068 |     8 | -rw-r--r-- | 1 | a | staff |     579 | Jun | 22 | 10:24 | ./2017-06-22/code-box.pwgl                                         |
| 17229057 |     8 | -rw-r--r-- | 1 | a | staff |     275 | Jun | 22 | 10:20 | ./2017-06-22/empty-pwgl-patch.pwgl                                 |
| 17229087 |     8 | -rw-r--r-- | 1 | a | staff |    1083 | Jun | 22 | 10:25 | ./2017-06-22/enp-constructor.pwgl                                  |
| 17229091 |     8 | -rw-r--r-- | 1 | a | staff |    1049 | Jun | 22 | 10:25 | ./2017-06-22/enp-score-notation.pwgl                               |
| 17229099 |     8 | -rw-r--r-- | 1 | a | staff |    1065 | Jun | 22 | 10:27 | ./2017-06-22/enp-script.pwgl                                       |
| 17229062 |     8 | -rw-r--r-- | 1 | a | staff |     838 | Jun | 22 | 10:22 | ./2017-06-22/lisp-code-box.pwgl                                    |
| 17229123 |     8 | -rw-r--r-- | 1 | a | staff |    1949 | Jun | 22 | 10:29 | ./2017-06-22/map-enum.pwgl                                         |
| 17229093 |     8 | -rw-r--r-- | 1 | a | staff |    2093 | Jun | 22 | 10:26 | ./2017-06-22/multi-pmc.pwgl                                        |
| 17229096 |     8 | -rw-r--r-- | 1 | a | staff |    2590 | Jun | 22 | 10:26 | ./2017-06-22/multi-score-pmc.pwgl                                  |
| 17229119 |     8 | -rw-r--r-- | 1 | a | staff |    1042 | Jun | 22 | 10:28 | ./2017-06-22/sc-info.pwgl                                          |
| 17229083 |     8 | -rw-r--r-- | 1 | a | staff |    2575 | Jun | 22 | 10:24 | ./2017-06-22/score-editor.pwgl                                     |
| 17229116 |     8 | -rw-r--r-- | 1 | a | staff |     751 | Jun | 22 | 10:27 | ./2017-06-22/scs-card.pwgl                                         |
| 17229065 |     8 | -rw-r--r-- | 1 | a | staff |     854 | Jun | 22 | 10:24 | ./2017-06-22/text-box.pwgl                                         |
| 17311534 |    72 | -rw-r--r-- | 1 | a | staff |   34117 | Jun | 25 | 14:21 | ./2017-06-23/enumerate-beats-to-measures-to-voices.pwgl            |
| 17309564 |    64 | -rw-r--r-- | 1 | a | staff |   29443 | Jun | 25 | 14:21 | ./2017-06-23/four-four-beats-and-three-eight-measures.pwgl         |
| 17313499 |    64 | -rw-r--r-- | 1 | a | staff |   31547 | Jun | 25 | 14:21 | ./2017-06-24/iterate-your-own-beat-constructor.pwgl                |
| 17324321 |    48 | -rw-r--r-- | 1 | a | staff |   23345 | Jun | 25 | 14:38 | ./2017-06-25/translate-three-pulses-code-to-rtm.pwgl               |
| 17075499 |  1160 | -rw-r--r-- | 1 | a | staff |  593379 | Dec | 18 |  2013 | ./large/MUSC7911.pwgl                                              |
| 17062710 |    16 | -rw-r--r-- | 1 | a | staff |    7719 | Jun |  8 | 19:31 | ./miscellaneous/2017-06-08/basic-pwgl-abstraction-as-lisp.pwgl     |
| 17052675 |  1344 | -rw-r--r-- | 1 | a | staff |  685847 | Jun |  8 | 21:03 | ./miscellaneous/2017-06-08/blank.pwgl                              |
| 17062724 |    16 | -rw-r--r-- | 1 | a | staff |    7842 | Jun |  8 | 19:31 | ./miscellaneous/2017-06-08/constructing-beats-and-measures2.pwgl   |
| 17062704 |   120 | -rw-r--r-- | 1 | a | staff |   58243 | Jun |  8 | 20:38 | ./miscellaneous/2017-06-08/generating-basic-RTMs.pwgl              |
| 17062835 |   104 | -rw-r--r-- | 1 | a | staff |   49687 | Jun |  8 | 20:16 | ./miscellaneous/2017-06-08/generating-basic-RTMs2.pwgl             |
| 17067177 |     8 | -rw-r--r-- | 1 | a | staff |     278 | Jun |  9 | 16:12 | ./miscellaneous/2017-06-09/load-an-abstraction-maybe.pwgl          |
| 17065037 |    64 | -rw-r--r-- | 1 | a | staff |   32608 | Jun |  9 | 14:18 | ./miscellaneous/2017-06-09/master-pc-sets-list.pwgl                |
| 17063150 |   136 | -rw-r--r-- | 1 | a | staff |   68828 | Jun |  9 | 08:52 | ./miscellaneous/2017-06-09/reassigning-pitches-with-RTMs.pwgl      |
| 17067527 |   472 | -rw-r--r-- | 1 | a | staff |  240798 | Jun |  9 | 19:33 | ./miscellaneous/2017-06-09/sc-info-code-in-blocks.pwgl             |
| 17066472 |    96 | -rw-r--r-- | 1 | a | staff |   45443 | Jun | 10 | 06:15 | ./miscellaneous/2017-06-10/arpeggio-sets-experiment.pwgl           |
| 17075733 |   248 | -rw-r--r-- | 1 | a | staff |  126205 | Jun | 10 | 14:23 | ./miscellaneous/2017-06-10/developing-variance.pwgl                |
| 17071928 |   120 | -rw-r--r-- | 1 | a | staff |   57913 | Jun | 10 | 21:23 | ./miscellaneous/2017-06-10/filtering-sc-info.pwgl                  |
| 17075463 |   184 | -rw-r--r-- | 1 | a | staff |   90673 | Jun | 10 | 21:23 | ./miscellaneous/2017-06-10/four-parts-as-chords.pwgl               |
| 17071365 |    96 | -rw-r--r-- | 1 | a | staff |   47554 | Jun | 10 | 06:14 | ./miscellaneous/2017-06-10/generate-triadic-hexachords.pwgl        |
| 17075731 |    56 | -rw-r--r-- | 1 | a | staff |   26891 | Jun | 10 | 14:22 | ./miscellaneous/2017-06-10/IFUNC-patching.pwgl                     |
| 17075706 |   328 | -rw-r--r-- | 1 | a | staff |  166803 | Jun | 10 | 14:44 | ./miscellaneous/2017-06-10/PMC-tetrachords-7911.pwgl               |
| 17071734 |    72 | -rw-r--r-- | 1 | a | staff |   34211 | Jun | 10 | 08:46 | ./miscellaneous/2017-06-10/score-harmony-scripting.pwgl            |
| 17075711 |   128 | -rw-r--r-- | 1 | a | staff |   63689 | Jun | 10 | 14:23 | ./miscellaneous/2017-06-10/two-chord-phrase-7911.pwgl              |
| 17075708 |   424 | -rw-r--r-- | 1 | a | staff |  215973 | Jun | 10 | 14:23 | ./miscellaneous/2017-06-10/voiced-hexachords-7911.pwgl             |
| 17066086 |    40 | -rw-r--r-- | 1 | a | staff |   18211 | Jun | 25 | 14:38 | ./most-useful-abstractions/set-choice-abstraction.pwgl             |
** find . -type f -name "*.org" -exec ls \{\} . \;
#+BEGIN_SRC bash
find . -type f -name "*.org" -exec ls \{\} . \;
#+END_SRC

#+RESULTS:
|     ./2017-06-13/README.org |
|                             |
|                          .: |
|                #readme.org# |
|                  2017-06-13 |
|                  2017-06-14 |
|                  2017-06-15 |
|                  2017-06-16 |
|                  2017-06-18 |
|                  2017-06-19 |
|                  2017-06-20 |
|                  2017-06-22 |
|                  2017-06-23 |
|                  2017-06-24 |
|                  2017-06-25 |
|                       large |
|               miscellaneous |
|    most-useful-abstractions |
|          problem-code.lisp~ |
|              problem2.lisp~ |
|                pwgl-as-lisp |
|                  readme.org |
|                 readme.org~ |
| ./2017-06-22/PWGL-boxes.org |
|                             |
|                          .: |
|                #readme.org# |
|                  2017-06-13 |
|                  2017-06-14 |
|                  2017-06-15 |
|                  2017-06-16 |
|                  2017-06-18 |
|                  2017-06-19 |
|                  2017-06-20 |
|                  2017-06-22 |
|                  2017-06-23 |
|                  2017-06-24 |
|                  2017-06-25 |
|                       large |
|               miscellaneous |
|    most-useful-abstractions |
|          problem-code.lisp~ |
|              problem2.lisp~ |
|                pwgl-as-lisp |
|                  readme.org |
|                 readme.org~ |
|                ./readme.org |
|                             |
|                          .: |
|                #readme.org# |
|                  2017-06-13 |
|                  2017-06-14 |
|                  2017-06-15 |
|                  2017-06-16 |
|                  2017-06-18 |
|                  2017-06-19 |
|                  2017-06-20 |
|                  2017-06-22 |
|                  2017-06-23 |
|                  2017-06-24 |
|                  2017-06-25 |
|                       large |
|               miscellaneous |
|    most-useful-abstractions |
|          problem-code.lisp~ |
|              problem2.lisp~ |
|                pwgl-as-lisp |
|                  readme.org |
|                 readme.org~ |
